src/Catalogs/СостоянияЧатБота/СостоянияЧатБота.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СостоянияЧатБота</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>НеНайдено</name>
      <description>Не найдено</description>
    </items>
    <items>
      <name>Стоп</name>
      <description>Стоп</description>
    </items>
    <items>
      <name>Уточнение</name>
      <description>Уточнение</description>
    </items>
  </predefined>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Действие</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступноИзЛюбогоСостояния</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяЗаполняемогоПараметра</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПримерЗаполняемогоПараметра</name>
    <type>
      <types>Boolean</types>
      <types>String</types>
      <types>Date</types>
      <types>Number</types>
      <types>AnyRef</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипСостояния</name>
    <type>
      <types>EnumRef.ТипыСостоянийЧатБота</types>
    </type>
  </attributes>
  <attributes>
    <name>КлючевыеСлова</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Высказывание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Параметры</name>
    <attributes>
      <name>ИмяПараметра</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Вложения</name>
    <attributes>
      <name>Вложение</name>
      <type>
        <types>CatalogRef.ПапкиФайлов</types>
        <types>CatalogRef.Файлы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/СостоянияЧатБота/Forms/ФормаЗаполненияПараметра/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Заголовок = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.ТекущееСостояние, "Высказывание");
	КлючСохраненияПоложенияОкна = КлючНазначенияИспользования;
	
	Если КлючНазначенияИспользования = "Многострочный" Тогда
		
		РежимОткрытияМногострочный = Истина;
		Элементы.ЗначениеСтрока.ПодсказкаВвода = Параметры.ИмяЗаполняемогоПараметра;
		ПолеВводаСтроки = "";
		Элементы.ЗначениеПроизвольногоТипа.Видимость = Ложь;
	Иначе
		
		РежимОткрытияМногострочный = Ложь;
		Элементы.ЗначениеПроизвольногоТипа.ПодсказкаВвода = Параметры.ИмяЗаполняемогоПараметра;
		Элементы.ЗначениеПроизвольногоТипа.ОграничениеТипа = Новый ОписаниеТипов(Параметры.ТипЗначения);
		Элементы.ЗначениеСтрока.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФорм

&НаКлиенте
Процедура Ответить(Команда)
	
	Если Не ВведенКорректныйПараметр() Тогда
		
		ТекстОшибки = НСтр("ru = 'Введен некорректный параметр'");
		
		Если РежимОткрытияМногострочный Тогда
		
			Элемент = Элементы.ЗначениеСтрока;
			
		Иначе
			
			Элемент = Элементы.ЗначениеПроизвольногоТипа;
		
		КонецЕсли;
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ЭтотОбъект, Элемент);
		
	КонецЕсли; 
	
	Если РежимОткрытияМногострочный Тогда
		
		Закрыть(ЗначениеСтрока);
		
	Иначе
		
		Закрыть(ЗначениеПроизвольногоТипа);
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция ВведенКорректныйПараметр()

	Если РежимОткрытияМногострочный Тогда
	
		Возврат Истина;
		
	Иначе
		
		Возврат Элементы.ЗначениеПроизвольногоТипа.ОграничениеТипа.СодержитТип(
			ТипЗнч(ЗначениеПроизвольногоТипа));
	
	КонецЕсли;

КонецФункции

#КонецОбласти
